Revit 2027 API
BuiltInFailures.ConnectorFailures.MismatchNoAvailableConnector Property
 Cannot add [Element] to System. There is no available connector matching the System Type ([Type Name]) for the System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchNoAvailableConnector { get; }
Public Shared ReadOnly Property MismatchNoAvailableConnector As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchNoAvailableConnector {
	FailureDefinitionId^ get ();
}
static member MismatchNoAvailableConnector : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace